#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azapi_resource_action.upload_connections_json will be created
  + resource "azapi_resource_action" "upload_connections_json" {
      + action                 = "hostruntime/admin/vfs/site/wwwroot/connections.json"
      + body                   = (known after apply)
      + id                     = (known after apply)
      + method                 = "PUT"
      + output                 = (known after apply)
      + resource_id            = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.Web/sites@2022-03-01"
      + when                   = "apply"
    }

  # azapi_resource_action.upload_host_json will be created
  + resource "azapi_resource_action" "upload_host_json" {
      + action                 = "hostruntime/admin/vfs/site/wwwroot/host.json"
      + body                   = jsonencode(
            {
              + extensionBundle = {
                  + id      = "Microsoft.Azure.Functions.ExtensionBundle.Workflows"
                  + version = "[1.*, 2.0.0)"
                }
              + functionTimeout = "00:05:00"
              + healthMonitor   = {
                  + counterThreshold     = 0.8
                  + enabled              = true
                  + healthCheckInterval  = "00:00:30"
                  + healthCheckThreshold = 6
                  + healthCheckWindow    = "00:02:00"
                }
              + logging         = {
                  + fileLoggingMode = "debugOnly"
                  + logLevel        = {
                      + default = "Information"
                    }
                }
              + version         = "2.0"
            }
        )
      + id                     = (known after apply)
      + method                 = "PUT"
      + output                 = (known after apply)
      + resource_id            = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.Web/sites@2022-03-01"
      + when                   = "apply"
    }

  # azurerm_api_connection.office365 will be created
  + resource "azurerm_api_connection" "office365" {
      + display_name        = (known after apply)
      + id                  = (known after apply)
      + managed_api_id      = "/subscriptions/5f33a090-5b5b-43ff-a6dd-e912e60767ec/providers/Microsoft.Web/locations/swedencentral/managedApis/office365"
      + name                = "office365-connection"
      + resource_group_name = "rg-vm-availability-logicapp"
      + tags                = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }
    }

  # azurerm_logic_app_standard.main will be created
  + resource "azurerm_logic_app_standard" "main" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + bundle_version                 = "[1.*, 2.0.0)"
      + client_affinity_enabled        = false
      + custom_domain_verification_id  = (known after apply)
      + default_hostname               = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + kind                           = (known after apply)
      + location                       = "swedencentral"
      + name                           = "la-vm-availability-monitor"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "rg-vm-availability-logicapp"
      + site_credential                = (known after apply)
      + storage_account_access_key     = (sensitive value)
      + storage_account_name           = (known after apply)
      + storage_account_share_name     = (known after apply)
      + tags                           = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }
      + use_extension_bundle           = true
      + version                        = "~4"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                        = false
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = "v4.0"
          + elastic_instance_minimum         = 1
          + ftps_state                       = "FtpsOnly"
          + http2_enabled                    = false
          + ip_restriction                   = [
              + {
                  + action     = "Allow"
                  + headers    = (known after apply)
                  + ip_address = "0.0.0.0/0"
                  + name       = "Allow all"
                  + priority   = 2147483647
                },
            ]
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = 1
          + public_network_access_enabled    = true
          + runtime_scale_monitoring_enabled = false
          + scm_ip_restriction               = [
              + {
                  + action     = "Allow"
                  + headers    = (known after apply)
                  + ip_address = "0.0.0.0/0"
                  + name       = "Allow all"
                  + priority   = 2147483647
                },
            ]
          + scm_min_tls_version              = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = false
          + use_32_bit_worker_process        = true
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = false

          + cors {
              + support_credentials = false
            }
        }
    }

  # azurerm_monitor_metric_alert.storage_availability will be created
  + resource "azurerm_monitor_metric_alert" "storage_availability" {
      + auto_mitigate            = true
      + description              = "Metric Alert for Storage Account Availability"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = (known after apply)
      + resource_group_name      = "rg-vm-availability-logicapp"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "Environment"       = "demo"
          + "ManagedBy"         = "terraform"
          + "Project"           = "vm-availability-monitoring"
          + "_deployed_by_amba" = "True"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-vm-availability-logicapp"
      + tags     = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }
    }

  # azurerm_role_assignment.resource_graph_reader will be created
  + resource "azurerm_role_assignment" "resource_graph_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/5f33a090-5b5b-43ff-a6dd-e912e60767ec"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.logic_app will be created
  + resource "azurerm_service_plan" "logic_app" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "swedencentral"
      + maximum_elastic_worker_count = 1
      + name                         = "asp-vm-availability-logicapp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-vm-availability-logicapp"
      + sku_name                     = "WS1"
      + tags                         = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }
      + worker_count                 = 1
      + zone_balancing_enabled       = false
    }

  # azurerm_storage_account.logic_app will be created
  + resource "azurerm_storage_account" "logic_app" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-vm-availability-logicapp"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_storage_container.azure_webjobs_hosts will be created
  + resource "azurerm_storage_container" "azure_webjobs_hosts" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "azure-webjobs-hosts"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = (known after apply)
    }

  # azurerm_storage_container.azure_webjobs_secrets will be created
  + resource "azurerm_storage_container" "azure_webjobs_secrets" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "azure-webjobs-secrets"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = (known after apply)
    }

  # azurerm_storage_management_policy.logic_app_blob will be created
  + resource "azurerm_storage_management_policy" "logic_app_blob" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = 30
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # azurerm_storage_queue.flow_job_triggers will be created
  + resource "azurerm_storage_queue" "flow_job_triggers" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383jobtriggers00"
      + resource_manager_id  = (known after apply)
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_share.logic_app_content will be created
  + resource "azurerm_storage_share" "logic_app_content" {
      + access_tier          = "TransactionOptimized"
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "la-vm-availability-monitor-content"
      + quota                = 100
      + resource_manager_id  = (known after apply)
      + storage_account_name = (known after apply)
      + url                  = (known after apply)
    }

  # azurerm_storage_table.flow_access_keys will be created
  + resource "azurerm_storage_table" "flow_access_keys" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383flowaccesskeys"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flow_instance_flows will be created
  + resource "azurerm_storage_table" "flow_instance_flows" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383948c519a17253a0flows"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flow_instance_flows2 will be created
  + resource "azurerm_storage_table" "flow_instance_flows2" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383a36dc2df3ad11b8flows"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flow_runtime_context will be created
  + resource "azurerm_storage_table" "flow_runtime_context" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383flowruntimecontext"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flow_subscription_summary will be created
  + resource "azurerm_storage_table" "flow_subscription_summary" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383flowsubscriptionsummary"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flow_subscriptions will be created
  + resource "azurerm_storage_table" "flow_subscriptions" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383flowsubscriptions"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.flows will be created
  + resource "azurerm_storage_table" "flows" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383flows"
      + storage_account_name = (known after apply)
    }

  # azurerm_storage_table.job_definitions will be created
  + resource "azurerm_storage_table" "job_definitions" {
      + id                   = (known after apply)
      + name                 = "flow2f9590d042a6383jobdefinitions"
      + storage_account_name = (known after apply)
    }

  # azurerm_user_assigned_identity.logic_app will be created
  + resource "azurerm_user_assigned_identity" "logic_app" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "mi-vm-availability-logicapp"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-vm-availability-logicapp"
      + tags                = {
          + "Environment" = "demo"
          + "ManagedBy"   = "terraform"
          + "Project"     = "vm-availability-monitoring"
        }
      + tenant_id           = (known after apply)
    }

  # random_string.storage_suffix will be created
  + resource "random_string" "storage_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_service_plan_name           = "asp-vm-availability-logicapp"
  + logic_app_id                    = (known after apply)
  + logic_app_name                  = "la-vm-availability-monitor"
  + logic_app_workflow_callback_url = (known after apply)
  + managed_identity_principal_id   = (known after apply)
  + office365_connection_name       = "office365-connection"
  + resource_group_name             = "rg-vm-availability-logicapp"
  + storage_account_name            = (known after apply)
  + storage_availability_alert_name = (known after apply)
  + workflow_trigger_url            = (known after apply)

```

</details>

*Pushed by: @Copilot, Action: `pull_request`*